In [1]:
# Import libraries

import pandas as pd

In [126]:
df = pd.read_csv("adult.data.csv")
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [3]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
age,32561.0,38.581647,13.640433,17.0,28.0,37.0,48.0,90.0
fnlwgt,32561.0,189778.366512,105549.977697,12285.0,117827.0,178356.0,237051.0,1484705.0
education-num,32561.0,10.080679,2.572720,1.0,9.0,10.0,12.0,16.0
capital-gain,32561.0,1077.648844,7385.292085,0.0,0.0,0.0,0.0,99999.0
capital-loss,32561.0,87.303830,402.960219,0.0,0.0,0.0,0.0,4356.0
hours-per-week,32561.0,40.437456,12.347429,1.0,40.0,40.0,45.0,99.0

# Questin 1

How many people of each race are represented in this dataset? 
This should be a Pandas series with race names as the index labels. 
(`race` column)

In [74]:
race = df['race'].value_counts().tolist()
race

[27816, 3124, 1039, 311, 271]

# Qustion 2
What is the average age of men?

In [75]:
men_data = df[df['sex'] == 'Male']
round(men_data['age'].mean(), 1)

39.4

# Question 3
What is the percentage of people who have a Bachelor's degree?

In [78]:
edu_percent = pd.DataFrame(df['education'].sort_values().value_counts())
edu_percent['percentage'] = edu_percent['education']/edu_percent['education'].sum()
bach = round(edu_percent['percentage'].loc['Bachelors'] * 100, 1)
bach

16.4

# Question 4

What percentage of people with advanced education 
(`Bachelors`, `Masters`, or `Doctorate`) make more than 50K?

In [7]:
def transform(dataframe):
    '''
    A function to transform the df to usable information
    '''

    edu_sal = pd.DataFrame(df[['education', 'salary']].value_counts()).rename(columns={0:'counts'}).reset_index()
    edu_sal['percentage'] = edu_sal['counts']/edu_sal['counts'].sum()
    return edu_sal

In [36]:
df2 = transform(df)
df2

       education salary  counts  percentage
0        HS-grad  <=50K    8826    0.271060
1   Some-college  <=50K    5904    0.181321
2      Bachelors  <=50K    3134    0.096250
3      Bachelors   >50K    2221    0.068210
4        HS-grad   >50K    1675    0.051442
5   Some-college   >50K    1387    0.042597
6           11th  <=50K    1115    0.034243
7      Assoc-voc  <=50K    1021    0.031357
8        Masters   >50K     959    0.029452
9           10th  <=50K     871    0.026750
10    Assoc-acdm  <=50K     802    0.024631
11       Masters  <=50K     764    0.023464
12       7th-8th  <=50K     606    0.018611
13           9th  <=50K     487    0.014957
14   Prof-school   >50K     423    0.012991
15          12th  <=50K     400    0.012285
16     Assoc-voc   >50K     361    0.011087
17       5th-6th  <=50K     317    0.009736
18     Doctorate   >50K     306    0.009398
19    Assoc-acdm   >50K     265    0.008139
20       1st-4th  <=50K     162    0.004975
21   Prof-school  <=50K     153    0.004699
22     Doctorate  <=50K     107    0.003286
23          10th   >50K      62    0.001904
24          11th   >50K      60    0.001843
25     Preschool  <=50K      51    0.001566
26       7th-8th   >50K      40    0.001228
27          12th   >50K      33    0.001013
28           9th   >50K      27    0.000829
29       5th-6th   >50K      16    0.000491
30       1st-4th   >50K       6    0.000184

In [58]:
def higher_education(dataframe):
    '''
    A function to calculate the percentage of higher_education
    above 50k
    '''
    higher_education_rich = []
    higher_education_list = ['Bachelors', 'Masters', 'Doctorate']

    for education in higher_education_list:
        '''
        I am using itertuples to loop through the rows
        '''
        for row in df2.itertuples():
            if row[1] == education and row[2] == '>50K':
                higher_education_rich.append(row[4])
    return round(sum(higher_education_rich), 5)

In [63]:
def lower_education(dataframe):
    '''
    A function to calculate the percentage of higher_education
    above 50k
    '''
    lower_education_rich = []
    higher_education_list = ['Bachelors', 'Masters', 'Doctorate']

    for education in higher_education_list:
        '''
        I am using itertuples to loop through the rows
        '''
        for row in df2.itertuples():
            if row[1] != education and row[2] == '>50K':
                lower_education_rich.append(row[4])
    return round(sum(lower_education_rich), 4)

In [79]:
test1 = higher_education(df2) * 100
test1

10.706

In [80]:
test2 = lower_education(df2) * 100
test2

61.53999999999999

# Question 5

What is the minimum number of hours a person works per week (hours-per-week feature)?

In [87]:
min_hr = pd.DataFrame(df[df['hours-per-week']== 1]['salary'].value_counts()) 
min_hr

       salary
<=50K      18
>50K        2

In [97]:
def percentage (data):
    '''
    A function to calculate percentage.

    '''
    col = data.columns
    data['percentage'] = data[col[0]]/data[col[0]].sum() * 100
    return pd.DataFrame(data['percentage'])

In [100]:
test = percentage(min_hr)
result = test.loc['>50K':]
result

      percentage
>50K        10.0

# Question 6

What country has the highest percentage of people that earn >50K and what is that percentage?

In [123]:
que_6 = df[['native-country', 'salary']]
que_6v = pd.DataFrame(que_6.value_counts()).rename({0:'counts'}, axis=1).reset_index()
que_6v = que_6v[que_6v['salary'] == '>50K']
que_6v['percentage'] = que_6v['counts']/que_6v['counts'].sum() * 100
que_6v

        native-country salary  counts  percentage
1        United-States   >50K    7171   91.455172
4                    ?   >50K     146    1.862007
15         Philippines   >50K      61    0.777962
23             Germany   >50K      44    0.561153
24               India   >50K      40    0.510139
26              Canada   >50K      39    0.497386
28              Mexico   >50K      33    0.420865
32             England   >50K      30    0.382604
34               Italy   >50K      25    0.318837
36                Cuba   >50K      25    0.318837
38               Japan   >50K      24    0.306083
40              Taiwan   >50K      20    0.255070
41               China   >50K      20    0.255070
43                Iran   >50K      18    0.229563
46               South   >50K      16    0.204056
53         Puerto-Rico   >50K      12    0.153042
54              Poland   >50K      12    0.153042
55              France   >50K      12    0.153042
56             Jamaica   >50K      10    0.127535
59         El-Salvador   >50K       9    0.114781
61              Greece   >50K       8    0.102028
62            Cambodia   >50K       7    0.089274
63          Yugoslavia   >50K       6    0.076521
64                Hong   >50K       6    0.076521
65             Ireland   >50K       5    0.063767
66             Vietnam   >50K       5    0.063767
67               Haiti   >50K       4    0.051014
68             Ecuador   >50K       4    0.051014
69            Portugal   >50K       4    0.051014
70            Thailand   >50K       3    0.038260
71             Hungary   >50K       3    0.038260
72            Scotland   >50K       3    0.038260
73           Guatemala   >50K       3    0.038260
74            Columbia   >50K       2    0.025507
75           Nicaragua   >50K       2    0.025507
76     Trinadad&Tobago   >50K       2    0.025507
77                Laos   >50K       2    0.025507
78  Dominican-Republic   >50K       2    0.025507
79                Peru   >50K       2    0.025507
81            Honduras   >50K       1    0.012753

# Question 7

Identify the most popular occupation for those who earn >50K in India.

In [163]:
que_7 = df[df['native-country'] == 'India']
que_7 = que_7[que_7['salary'] == '>50K']
que_7 = pd.DataFrame(que_7[['occupation', 'salary']])
que_7 = pd.DataFrame(que_7.value_counts()).rename({0:'counts'}, axis=1).reset_index()
answer = que_7[que_7['counts'] == 25]
answer = answer['occupation'].tolist()
answer[0]

'Prof-specialty'

In [ ]:
que_7 = max(que_7[0])
que_7